simulations/batch6/sim17/system/setExprFieldsDict
/*--------------------------------*- C++-*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

expressions
(

	alpha.water
	{
		field 			alpha.water;
		dimensions		[0 0 0 0 0 0 0];

		constants
		{
			mean 	0;
		}
		variables
		(
			"std = 0.1"
			"var = pow(std,2)"
		);
		condition
		#{
			pos().y() < exp((-0.5)*(pos().x()*pos().x()))
		#};
		expression
		#{
			1
		#};
	}

);

// * * * * * * * * * * * * * * * * * * * * * * * * * * //